AlertEvents
  AlertId
  EventTime
  MachineId
  ComputerName
  Severity
  Category
  Title
  ActionType
  ReportId
  SHA1
  FileName
  RemoteUrl
  RemoteIP

ProcessCreationEvents
  EventTime
  MachineId
  ComputerName
  ActionType
  ReportId
  SHA1
  SHA256
  MD5
  FileName
  ProcessId
  ProcessCommandLine
  ProcessIntegrityLevel
  ProcessTokenElevation
  ProcessCreationTime
  FolderPath
  InitiatingProcessAccountDomain
  InitiatingProcessAccountName
  AccountSid
  AccountDomain
  AccountName
  InitiatingProcessAccountSid
  InitiatingProcessIntegrityLevel
  InitiatingProcessTokenElevation
  InitiatingProcessSHA1
  InitiatingProcessSHA256
  InitiatingProcessMD5
  InitiatingProcessFileName
  InitiatingProcessId
  InitiatingProcessCommandLine
  InitiatingProcessCreationTime
  InitiatingProcessFolderPath
  InitiatingProcessParentId
  InitiatingProcessParentName
  InitiatingProcessParentCreationTime

NetworkCommunicationEvents
  EventTime
  MachineId
  ComputerName
  ActionType
  ReportId
  InitiatingProcessSHA1
  InitiatingProcessMD5
  InitiatingProcessFileName
  InitiatingProcessId
  InitiatingProcessCommandLine
  InitiatingProcessCreationTime
  InitiatingProcessFolderPath
  InitiatingProcessParentName
  InitiatingProcessParentId
  InitiatingProcessParentCreationTime
  RemoteIP
  RemotePort
  RemoteUrl
  LocalIP
  LocalPort
  InitiatingProcessAccountDomain
  InitiatingProcessAccountName
  InitiatingProcessAccountSid
  InitiatingProcessIntegrityLevel
  InitiatingProcessTokenElevation

FileCreationEvents
  EventTime
  MachineId
  ComputerName
  ActionType
  ReportId
  SHA1
  SHA256
  MD5
  FileName
  FolderPath
  FileOriginUrl
  FileOriginReferrerUrl
  FileOriginIP
  InitiatingProcessAccountDomain
  InitiatingProcessAccountName
  InitiatingProcessAccountSid
  InitiatingProcessMD5
  InitiatingProcessSHA1
  InitiatingProcessFolderPath
  InitiatingProcessFileName
  InitiatingProcessId
  InitiatingProcessCommandLine
  InitiatingProcessCreationTime
  InitiatingProcessIntegrityLevel
  InitiatingProcessTokenElevation
  InitiatingProcessParentId
  InitiatingProcessParentName
  InitiatingProcessParentCreationTime

RegistryEvents
  EventTime
  MachineId
  ComputerName
  ActionType
  ReportId
  InitiatingProcessAccountDomain
  InitiatingProcessAccountName
  InitiatingProcessAccountSid
  InitiatingProcessSHA1
  InitiatingProcessMD5
  InitiatingProcessFileName
  InitiatingProcessId
  InitiatingProcessCommandLine
  InitiatingProcessCreationTime
  InitiatingProcessFolderPath
  InitiatingProcessParentId
  InitiatingProcessParentName
  InitiatingProcessParentCreationTime
  InitiatingProcessIntegrityLevel
  InitiatingProcessTokenElevation
  RegistryKey
  RegistryKeyValueType
  RegistryKeyValueName
  RegistryKeyValueData
  RegistryKeyPreviousKeyValueName
  RegistryKeyPreviousKeyValueData

LogonEvents
  EventTime
  MachineId
  ComputerName
  ActionType
  ReportId
  AccountName
  AccountDomain
  AccountSid
  LogonType

ImageLoadEvents
  EventTime
  MachineId
  ComputerName
  ActionType
  ReportId
  SHA1
  MD5
  FileName
  FolderPath
  InitiatingProcessAccountDomain
  InitiatingProcessAccountName
  InitiatingProcessAccountSid
  InitiatingProcessIntegrityLevel
  InitiatingProcessTokenElevation
  InitiatingProcessSHA1
  InitiatingProcessMD5
  InitiatingProcessFileName
  InitiatingProcessId
  InitiatingProcessCommandLine
  InitiatingProcessCreationTime
  InitiatingProcessFolderPath
  InitiatingProcessParentId
  InitiatingProcessParentName
  InitiatingProcessParentCreationTime

MiscEvents
  EventTime
  MachineId
  ComputerName
  ActionType
  ReportId
  SHA1
  MD5
  InitiatingProcessSHA1
  InitiatingProcessSHA256
  InitiatingProcessFileName
  InitiatingProcessFolderPath
  InitiatingProcessId
  InitiatingProcessCommandLine
  InitiatingProcessCreationTime
  InitiatingProcessParentId
  InitiatingProcessParentName
  InitiatingProcessParentCreationTime
  InitiatingProcessMD5
  InitiatingProcessAccountDomain
  InitiatingProcessAccountName
  InitiatingProcessAccountSid
  FileName
  FolderPath
  AccountName
  AccountDomain
  RemoteUrl
  AdditionalFields
